# EndPoint Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LineSegment..::..EndPoint Property
LineSegment Class See Also
---
End point of the line segment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ EndPoint { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EndPoint As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ EndPoint {
	XYZ^ get ();
}
```

# See Also
LineSegment Class
Autodesk.Revit.DB Namespace